app/views/questions/index.html.erb

SELECT  "question_votes".* FROM "question_votes" WHERE "question_votes"."question_id" = $1 AND "question_votes"."user_id" = $2 LIMIT 1  [["question_id", 2], ["user_id", 2]]
SELECT  "question_votes".* FROM "question_votes" WHERE "question_votes"."question_id" = $1  ORDER BY "question_votes"."id" DESC LIMIT 1  [["question_id", 1]]
SELECT  "question_votes".* FROM "question_votes" WHERE "question_votes"."question_id" = $1  ORDER BY "question_votes"."id" ASC LIMIT 1  [["question_id", 1]]
SELECT COUNT(*) FROM "question_votes" WHERE "question_votes"."question_id" = $1 AND "question_votes"."vote" = 't'  [["question_id", 1]]
---
      <li><%= question.title %>
        <% if question.question_votes.find_by_user_id(current_user.id) && question.question_votes.find_by_user_id(current_user.id).vote == true %>
          <%= link_to 'Upvote', '/', method: :get %>
          <%= link_to 'Downvote', question_question_vote_path(question.id, question.question_votes.last.id), method: :delete %>
          <p>Score: <%= question.question_votes.where(vote: true).count + question.question_votes.where(vote: false).count %></p>