app/views/questions/show.html.erb

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 1]]
SELECT  "answer_votes".* FROM "answer_votes" WHERE "answer_votes"."answer_id" = $1 AND "answer_votes"."user_id" = $2 LIMIT 1  [["answer_id", 1], ["user_id", 3]]
---
  <% if current_user %>
    <% @question.answers.each do |answer| %>
      <li><%= answer.title %></li>
      <% if answer.answer_votes.find_by_user_id(current_user.id) && answer.answer_votes.find_by_user_id(current_user.id).vote == true %>

SELECT  "answer_votes".* FROM "answer_votes" WHERE "answer_votes"."answer_id" = $1  ORDER BY "answer_votes"."id" DESC LIMIT 1  [["answer_id", 1]]
SELECT COUNT(*) FROM "answer_votes" WHERE "answer_votes"."answer_id" = $1 AND "answer_votes"."vote" = 't'  [["answer_id", 1]]
---
        <%= link_to 'Downvote', question_answer_answer_vote_path(answer_id: answer.id, question_id: params[:id]), method: :delete %>
        <p>Score: <%= answer.answer_votes.where(vote: true).count + answer.answer_votes.where(vote: false).count %></p>