app/controllers/answers_controller.rb

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "answers" ("question_id", "content", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["question_id", 1], ["content", "weg sd wegwe"], ["title", "dag arweg "], ["created_at", "2015-06-09 01:39:18.112699"], ["updated_at", "2015-06-09 01:39:18.112699"]]
---
  def create
    @question = Question.find(params[:question_id])
    @answer = Answer.new(answer_params)

    if @answer.save