app/controllers/answer_votes_controller.rb

SELECT  "answer_votes".* FROM "answer_votes" WHERE "answer_votes"."user_id" = $1 AND "answer_votes"."answer_id" = $2 AND "answer_votes"."vote" = $3 LIMIT 1  [["user_id", 1], ["answer_id", 2], ["vote", "t"]]
DELETE FROM "answer_votes" WHERE "answer_votes"."id" = $1  [["id", 5]]
INSERT INTO "answer_votes" ("user_id", "answer_id", "vote", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 3], ["answer_id", 1], ["vote", "t"], ["created_at", "2015-06-09 23:32:36.169740"], ["updated_at", "2015-06-09 23:32:36.169740"]]
---
  def create
    user_upvote = AnswerVote.find_by(user_id: current_user.id, answer_id: params[:answer_id], vote: true)
    user_downvote = AnswerVote.find_by(user_id: current_user.id, answer_id: params[:answer_id], vote: false)

    if user_upvote
      user_upvote.destroy
      redirect_to "/questions/#{params[:question_id]}"
    elsif user_downvote
      user_downvote.destroy
      redirect_to "/questions/#{params[:question_id]}"
    else
      @answer_vote = AnswerVote.new(user_id: current_user.id, answer_id: params[:answer_id], vote: params[:vote])
      if !@answer_vote.save

SELECT  "answer_votes".* FROM "answer_votes" WHERE "answer_votes"."user_id" = $1 AND "answer_votes"."answer_id" = $2 LIMIT 1  [["user_id", 3], ["answer_id", 1]]
DELETE FROM "answer_votes" WHERE "answer_votes"."id" = $1  [["id", 1]]
---
  def destroy
    @answer_vote = AnswerVote.find_by(user_id: current_user.id, answer_id: params[:answer_id])
    @answer_vote.destroy