app/controllers/question_votes_controller.rb

INSERT INTO "question_votes" ("user_id", "question_id", "vote", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["question_id", 1], ["vote", "t"], ["created_at", "2015-06-09 19:35:53.495710"], ["updated_at", "2015-06-09 19:35:53.495710"]]
---
  def create
    p params
    @question_vote = QuestionVote.new(user_id: params[:user_id], question_id: params[:question_id], vote: params[:vote])
    if !@question_vote.save

SELECT  "question_votes".* FROM "question_votes" WHERE "question_votes"."user_id" = $1 AND "question_votes"."question_id" = $2 LIMIT 1  [["user_id", 1], ["question_id", 1]]
DELETE FROM "question_votes" WHERE "question_votes"."id" = $1  [["id", 1]]
---
  def destroy
    @question_vote = QuestionVote.find_by(user_id: params[:user_id], question_id: params[:question_id])
    @question_vote.destroy