app/controllers/questions_controller.rb

  def index
    @questions = Question.all
    @question_vote = QuestionVote.find_by(user_id: params[:user_id], question_id: params[:question_id])
---
SELECT "questions".* FROM "questions"
SELECT  "question_votes".* FROM "question_votes" WHERE "question_votes"."question_id" = $1 AND "question_votes"."user_id" = $2 LIMIT 1  [["question_id", 2], ["user_id", 2]]

  def create
    @question = Question.new(question_params)

    if @question.save
---
INSERT INTO "questions" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "hey"], ["content", "hello there"], ["created_at", "2015-06-09 00:11:59.321955"], ["updated_at", "2015-06-09 00:11:59.321955"]]

  def update
    question = Question.find(params[:id])
    question.update_attributes(question_params)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "questions" SET "content" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["content", "hello there!!!!"], ["updated_at", "2015-06-09 03:18:46.099366"], ["id", 2]]