app/controllers/question_votes_controller.rb

SELECT  "question_votes".* FROM "question_votes" WHERE "question_votes"."user_id" = $1 AND "question_votes"."question_id" = $2 AND "question_votes"."vote" = $3 LIMIT 1  [["user_id", 1], ["question_id", 1], ["vote", "t"]]
DELETE FROM "question_votes" WHERE "question_votes"."id" = $1  [["id", 11]]
---
  def create
    user_upvote = QuestionVote.find_by(user_id: current_user.id, question_id: params[:question_id], vote: true)
    user_downvote = QuestionVote.find_by(user_id: current_user.id, question_id: params[:question_id], vote: false)

    if user_upvote
      user_upvote.destroy